[
    {
      "id": "2010",
      "abstract": "A great accessory to attach a guitar strap without having to tie it or worry about metal clasps scratching the finish. Looks SO much better than nylon or leather cords. The leather is soft but strong and feels great. I got the brown for my acoustic guitar but will likely order a black as well.",
      "title": "5"
    },
    {
      "id": "2011",
      "abstract": "This silicone works well for a number of uses around the house. At the moment we've used it in our bathtub, refrigerator and outside on the sprinkler,",
      "title": "5"
    },
    {
      "id": "2012",
      "abstract": "These are great wide range thermometers. I use them all the time when grilling and with a low range down to -40C I also use them to test the temps in my fridge and freezers.",
      "title": "5"
    },
    {
      "id": "2013",
      "abstract": "Good quality pipette pump. Fits most standard 25ml pipettes as well as some 5, 10 and 50ml pipettes. Excellent for dosing my aquarium with specific volumes of medication and fertilizers.",
      "title": "5"
    },
    {
      "id": "2014",
      "abstract": "An excellent replacement for my Kenmore dishwasher. I wasn't sure it would fit but it's exactly what I needed. Great reacement!",
      "title": "5"
    },
    {
      "id": "2015",
      "abstract": "I got this basket to hang plants in the house near our sun window. The planter was easy to setup and fill and the no hole bottom means no leaks on the floor. The chains can easily hold the weight of a full pot that's heavily watered. The hook on the end is also thin enough that the pot can be hung from a standard 50lbs picture frame hanger without any difficulty! If using the pot outside however I would suggest drilling holes in the bottom and adding some screen in to make sure rainwater has a way of getting out and not flooding the pot.",
      "title": "5"
    },
    {
      "id": "2016",
      "abstract": "These are fun bath toys, but only work for a short time. Once they get even slightly wet they begin to dissolve and fall apart almost immediately. We only got 2 or 3 uses out of them before they were a total mess. They are also difficult to use on some smooth tub surfaces, while on other more porous surfaces they can be difficult to clean up. Be careful when using.",
      "title": "3"
    },
    {
      "id": "2017",
      "abstract": "They're scissors, they're super sharp and they get the job done.",
      "title": "5"
    },
    {
      "id": "2018",
      "abstract": "Other reviewers indicated that the suit ran small so I ordered one size up and it was still a smaller than my wife liked. The straps on the suit were also much thinner than what was pictured in the photo. My wife didn't like the fit at all but figured she'd keep it as a backup for next summer.",
      "title": "2"
    },
    {
      "id": "2019",
      "abstract": "If you have have an Xbox 360 4G DO NOT BUY THIS! Although it says it runs on Xbox 360, it will only run on systems that have have a Microsoft hard hard drive with original Xbox emulation software, which the 4G model lacks. 3rd party drives don't have this and official drives cost $100+. I didn't realize this when when purchased the game and I'm not willing to spend that much much to play an older game. I'll definitely be returning this to a Gamestop.",
      "title": "2"
    },
    {
      "id": "20110",
      "abstract": "I'm fine with how small this pillow is (not much larger than a throw pillow on a couch) but what really disappointed me was how thin the pillow was. They could have easily gotten 2 to 3 times more buckwheat in if they tried. At most this pillow is MAYBE 2 inches thick. It's more or less useless as s bed pillow. I'll probably return it.",
      "title": "2"
    },
    {
      "id": "20111",
      "abstract": "This is a great, easy to install coat/towel rack. The pegs are tapered down to keep the coats/towels from falling off and the rack installs quickly and easily with 2 screws. We use a number of the 4 and 6 peg racks around our house and love them.",
      "title": "5"
    },
    {
      "id": "20112",
      "abstract": "Got this to hang my wife's scarves on and it looks/works fantastic! Easy to hang and went up in about 5 minutes. For scarves or lighter clothes it's fine but I wouldn't use it for heavy coats or bags.",
      "title": "5"
    },
    {
      "id": "20113",
      "abstract": "These screens work great for keeping food from splattering out of pots/pans. You can't beat the price either. The only problem I had was that the handles were a little heavy so the screens would sometimes fall off the pan. If you balance the screen handle on the pan handle it's not a problem however.",
      "title": "4"
    },
    {
      "id": "20114",
      "abstract": "Good squeeze bottle for various kitchen uses. Over time the plastic can warp so be careful with the bottles around hot water or stored in a position when they may be partially crushed.",
      "title": "4"
    },
    {
      "id": "20115",
      "abstract": "Good boxes for storage and safe for young kids. They are hard to clean however. Simply wiping them down with water sometimes isn't enough and sending them through the washing machine will make them useless as they no longer hold the box shape. If you have to clean these boxes soak them in a deep sink or tub instead.",
      "title": "4"
    },
    {
      "id": "20116",
      "abstract": "We purchased one of these for our bed and almost immediately our son demanded one as well. The padding is soft and manageable, fantastic for anyone looking for a good night sleep. They can be a little cumbersome to setup the first time but once they're on the bed they are super comfortable.",
      "title": "5"
    },
    {
      "id": "20117",
      "abstract": "Decent soda can dispenser. Mine arrived with some cracks in the plastic coating. I'm hoping they don't rust out in the refrigerator. Aside from that it gets the job done and saves a lot of space.",
      "title": "4"
    },
    {
      "id": "20118",
      "abstract": "These cubes are fantastic for lunches at work/school. Everyone in our house uses these and we have been VERY happy with their performance. The only complaint we have is that the front clip can occasionally pop off but they are easy to replace. If the clip is lost however the unit does not stay closed so be careful to hang onto them.",
      "title": "5"
    },
    {
      "id": "20119",
      "abstract": "Standard chopsticks that function as a they should. They come with a case but it was cracked in delivery so I tossed it out. Overall though the chopsticks themselves work well, feel good and are very dishwasher safe.",
      "title": "4"
    },
    {
      "id": "20120",
      "abstract": "I use command hooks for all kinds of things around the house and these are an excellent addition to the collection. At the moment these hooks are being used to hold up holiday lights inside and are doing a great job. The clear color also makes them almost invisible when not in use.",
      "title": "5"
    },
    {
      "id": "20121",
      "abstract": "My wife and I have ordered Winsome pieces previously and been very happy. In this case however we were VERY disappointed with the 2 units we ordered. The espresso color was way off of compared to the previously ordered pieces and was even inconsistent between the various panels. Saying that this unit has \"1-Drawer\" is really over stating it. It's really just a sliding box with no sliding hardware aside from a single wooden peg that's suppose to hold the drawers in place but easily falls out. Without the addition of some felt on the bottom the drawers would easily scratch the heck out of the shelf. The finish on the piece is also very brittle and cracked in numerous places while we were putting them together. Lastly, I didn't think to check before I ordered but this unit is VERY short. More than 10 inches shorter than any other nightstand I've ever seen. Overall not worth the cost but now that they're built I'm not going to bother going through the effort to return them and will likely just sell them on CL.",
      "title": "1"
    },
    {
      "id": "20122",
      "abstract": "This is a decent frame and is easy to load and hang.",
      "title": "5"
    },
    {
      "id": "20123",
      "abstract": "This is a great cute little sign to hang up over your coffee machine. It's small enough to easily fit into a back-splash and the rope makes it super easy to hang. I wish I could find more signs like this.",
      "title": "5"
    },
    {
      "id": "20124",
      "abstract": "The hooks shown are asymmetric, however the hooks I received were symmetrical and far less effective. The balls on one ends are also  larger than they appear and needed to be ripped off to fit a standard hole. Not worth shipping shipping back but not what what I wanted either.",
      "title": "1"
    },
    {
      "id": "20125",
      "abstract": "Great frame for either horizontal or vertical hanging. In the vertical position however the hanger isn't centered so getting the frame to sit straight can be hard. The backings for the photos are also a little flimsy and mine was missing a few of the clips to hold them in.",
      "title": "4"
    },
    {
      "id": "20126",
      "abstract": "I got this mattress a little over a month ago. I like it but it is a little stiffer than I was hoping for. Overall though it's good quality for the price and doesn't need a boxspring.",
      "title": "4"
    },
    {
      "id": "20127",
      "abstract": "This bedskirt looks good and is easy to install but doesn't stay in place with beds that have frames attached to a headboard. Without a corner to wrap around at the top of the bed the elastic just pulls the skirt off and looks droopy and horrible. The video claims you can use it with a headboard but I don't see any way to do that without nailing this thing down which I'm not about to do. Great idea, but bad design.",
      "title": "3"
    },
    {
      "id": "20128",
      "abstract": "Great picture frame for small areas. Easy to setup and hang. They are also rather light and work well on plastic hangers like one may use in a cubical space.",
      "title": "5"
    },
    {
      "id": "20129",
      "abstract": "These are great measuring spoons for use around the kitchen. Their bright colors make them easy to spot which is a huge help. My only complaint is that the ring on the spoons is a little flimsy and has come apart on all 3 sets I ordered after minimal use.",
      "title": "4"
    },
    {
      "id": "20130",
      "abstract": "Very happy with this painting. It looks exactly like the one in the photo with minor differences and matches our room perfectly. Would highly recommend this seller and have plans to purchase more from them.",
      "title": "5"
    },
    {
      "id": "20131",
      "abstract": "This frame is easy to load and hang. Overall works well and gets the job done.",
      "title": "5"
    },
    {
      "id": "20132",
      "abstract": "This is a very nice looking headboard for the price. It seems to be a little wider than the bed frames we have. I'm not sure if our frames are just a little small or if the headboard is a little large.",
      "title": "4"
    },
    {
      "id": "20133",
      "abstract": "This slicer has been fantastic to get my family eating more vegetables. We regularly use it to make veggie spaghetti for salads and in place of standard pasta and love it.",
      "title": "5"
    },
    {
      "id": "20134",
      "abstract": "These are decent chopsticks although they are a little shorter than I was expecting. They also had a plastic smell that took multiple washes to remove. As a result i was a little reluctant to used the for eating and decided to use them as decor in some of the artwork in our kitchen and dining room.",
      "title": "3"
    },
    {
      "id": "20135",
      "abstract": "This is a nice shoe rack for anyone with kids that need a seat for getting shoes on and off. I thought the unit would be already assembled and was surprised when it came as parts in a box. It was easy enough to put together but many of the edges hadn't been properly sanded down and I received a LOT of splinters putting it together. The instructions were also VERY poor quality, amounting to nothing more than a heavily faded xerox page that I could barely read. The unit itself works fine as a shoe rack but honestly I wouldn't purchase it again.",
      "title": "3"
    },
    {
      "id": "20136",
      "abstract": "This is a very nice looking headboard for the price. It seems to be a little wider than the bed frames we have. I'm not sure if our frames are just a little small or if the headboard is a little large.",
      "title": "4"
    },
    {
      "id": "20137",
      "abstract": "Overall this is a great frame. It's SUPER easy to assemble and goes together in about 10-15 minutes. The frame is solid, supportive and excellent for foam style mattresses (Casper, Tuft & Needle, etc.). My only complaint was the difficulty attaching a headboard. Because the frame has thicker legs than standard frames most hardware for attaching a headboard won't be long enough to work with this frame. Luckily I happened to have extra screws from a previous project that were compatible with my headboard and long enough to use with this frame but for others finding appropriate longer replacement screws could be a real challenge.",
      "title": "4"
    },
    {
      "id": "20138",
      "abstract": "Great scoops for anyone who uses tea or coffee grounds. I got two of these for my wife and she LOVES them and they keep things significantly more organized. A MUST have!",
      "title": "5"
    },
    {
      "id": "20139",
      "abstract": "This is a great cookbook for magazine recipes or index card recipes. It really helped organize a few of our kitchen drawers.",
      "title": "3"
    },
    {
      "id": "20140",
      "abstract": "I used this fan to mod my desktop and increase airflow to my video card. The fan is very quiet and supplies a lot of directed airflow. The connector is also pretty long making it easy to connect to either the motherboard or a 4-pin molex connector (using the included adapter).",
      "title": "5"
    },
    {
      "id": "20141",
      "abstract": "I used these feet on the bottom of a PC to raise it off the floor a bit. I was expecting soft rubber but the plastic that these feet are made of is really hard. As a result the vibration from the computer was transferred to the floor and would occasionally cause an audible vibration against the floor. The adhesive on the feet was horrible. I cleaned the area on the case before I attached the feet but within 3 weeks the feet had become detached and the adhesive was completely dry. Be careful what you use these feet for.",
      "title": "2"
    },
    {
      "id": "20142",
      "abstract": "I bought my first package of these to help clean up the cords behind my TV. Since then I've found these ties to be incredibly useful all over the house, and have already purchased two more packages. Everyone should have a bag of these in their toolbox!",
      "title": "5"
    },
    {
      "id": "20143",
      "abstract": "For the price this is a decent cooling rack. It's not as good as some of the $35-50 versions but you get what you pay for. The 3 fans do a decent job of moving air around under the laptop and keep things pretty cool. There are also feet on the pad which help keep the laptop raised a little to increase air intake. The unit is VERY quiet, but even with 3 fans it doesn't move a huge amount of air. On the downside the plastic over the fans is thin and if the laptop is misplaced you'll heard a buzz (as the plastic hits the fan) or sometimes the fan will just stop. Unlike the photos the unit I got has 3 VERY bright blue LCD lights in the front that get annoying. I covered them with some electrical tape.",
      "title": "4"
    },
    {
      "id": "20144",
      "abstract": "Small but good cable. Don't get any noticeable interference and it was just long enough to let me move one of my speakers onto the next shelf.",
      "title": "4"
    },
    {
      "id": "20145",
      "abstract": "For cheap earbuds these are fantastic. Good sound, fit well and are pretty durable. I ordered multiple pairs and have been very pleased with them. Audiophiles might not like them but for most people these are great.",
      "title": "4"
    },
    {
      "id": "20146",
      "abstract": "This is a fantastic clock. I bought one for myself and a second for my wife a few months later. With LED brightness adjustment, easy alarm setting and 2 seperate alarm times this is a fantastic clock. I would have preferred red LEDs but aside from that this is a great unit.",
      "title": "4"
    },
    {
      "id": "20147",
      "abstract": "Used these sticks to upgrade my Dell Inspiron 530s from 2GB to 4GB. The sticks installed fine and are holding up very well under heavy usage.",
      "title": "5"
    },
    {
      "id": "20148",
      "abstract": "This is the best arm band I've tried so far. The strap is entirely velcro so it can size for large and small arms which is great for my wife and I. the protective screen also does a great job of both protecting the iPod as well as transferring your touch for the menus/selections etc, which was a problem in my previous armband (different company). My only complaint is that the hold button is a little hard to get to under the lip of the plastic case. Other than that this is great!!",
      "title": "4"
    },
    {
      "id": "20149",
      "abstract": "This hard drive works great. I plugged it in and was using it in less than 5 minutes. Both the USB and power cords are plenty long enough and unlike my last external hard drive there are no annoyingly bright LEDs on the front, just a simple small LED on the back. I would definitely recommend this unit.",
      "title": "5"
    },
    {
      "id": "20150",
      "abstract": "Easy to install, great for transferring SATA power supply connecors to 4-pin molex for use on older hard drives or additional fans.",
      "title": "5"
    },
    {
      "id": "20151",
      "abstract": "Purchased this battery as a replacement for a dead unit and it worked fantastic from the moment I plugged it in. Charges and discharges well, and thus far has held its charges better than the original.",
      "title": "5"
    },
    {
      "id": "20152",
      "abstract": "This is a fantastic car mount. The adhesive allows for the mount to be attached to both the glass as well as the dashboard, even if it's textured. It holds the phone steady and has retractile gripping arms that keep the phone from moving sideways. In the future I hope this group makes a version that includes a power cable but aside from that this is the best car mount I've ever used.",
      "title": "5"
    },
    {
      "id": "20153",
      "abstract": "Used the power supply to revive a dead Inspiron 530s. Went in easy and had plenty of connectors to power all the innards of the machine. The unit is VERY quiet, generating less noise than the original. Although the page says 350W the unit I recieved said 400W on the sticker which was and additional plus.",
      "title": "5"
    },
    {
      "id": "20154",
      "abstract": "I prefer to use a single earbud while working so I can still hear what's going on around me and these are a perfect solution. The sound is good quality and the fabric coated cord is very durable. It would be nice if there was a version with a microphone and/or volume control but aside from that these are very impressive earbuds and better than many of the others I've tried.",
      "title": "5"
    },
    {
      "id": "20155",
      "abstract": "Decent cables, better than a lot of others that I've gotten for a similar price. These cables are thicker than some but seem to last a lot longer. File transfers work fine over these cables but charging devices can take a little longer because of reduced voltage do to the 6 ft length. My only complaint is that the pins on the micro-usb end that hold the cable in place have failed on about half the cables I ordered resulting in cables that easily slip out of place.",
      "title": "4"
    },
    {
      "id": "20156",
      "abstract": "I got this camera because of it's small size. Overall it's a decent setup although I was expected more having payed less for better cameras in the past. Setup of the unit was a little tricky and it took me quite a few tries to get it up and running since the directions are a little confusing but once it was running it did a pretty decent job.\n\nPros:\n- Small size\n- Comes with multiple mounting options\n- Multiple cameras can be watched at once\n\nCons:\n- This is not actually an IP camera and requires special apps/software to view and can not be logged into directly via IP address. The mobile phone apps are available in their respective app stores but tablet and desktop apps need to be downloaded from the website included in the directions. It can be used as a true IP camera if a desktop is setup as a server.\n- Not secure. I see no way to change the default password to the unit, meaning anyone at SSC or Toughsty (the software/hardware manufacturers) could potentially be watching your stream.\n- If configured for use over a wifi router (IP setting on the unit), the unit will ALWAYS be streaming when it is plugged in. If you're planning to use the camera intermittently and would like to just charge it make sure you're placing it in a safe area or remove the SD card before plugging it in.\n- A time stamp appears on the video stream but is set for the wrong time. It appears to be set for GMT +8 (China, etc), and there appears to be no way to change or remove this from the feed which is annoying. (I've submitted a question to the seller regarding this and am waiting to hear back.)",
      "title": "3"
    },
    {
      "id": "20157",
      "abstract": "I purchased this card as a replacement for a GeForce 8400GS which died, to put into my low profile HTPC (Dell Inspiron 530s). After attaching the low profile bracket, the card installed easily. It should be noted that the heatsink of the card is large and could possibly get in the way of other PCI slots (although I don't have any other cards installed so I couldn't tell for sure). After a fresh install of the newest drivers the card was easily able to output 720p and 1080i/p without any issues. Audio over HDMI also works great.\n\nThe box claims that the card runs at 35*C but using a vid card monitor I wasn't able to get that temp from the card. In my low profile rig the ambient temp is between 42 and 50*C depending largely on the ambient temperature in the room. Under load (Assasin's Creed, Mass Effect 2, etc.) the card seems to max out around 67*C, but quickly cools afterward. IMO these temps are a little warm but well within the range I'd expect from a low profile machine which typically have less airflow and generally idle warmer than other machines. I've got a low profile slot blower on order now which will hopefully keep the temp down.\n\nOverall a great card for the price maximizing power and function in a low profile setup.",
      "title": "4"
    },
    {
      "id": "20158",
      "abstract": "These are good earbuds with fabric covering that it very durable. My only complint is that they are designed to only be used with the phone/ipod on your left arm. If you're left handed and put the device on your right arm you'll need to switch the left/right earbuds which can cause issues if you're listening to anything with directional stereo.",
      "title": "4"
    },
    {
      "id": "20159",
      "abstract": "This is a great bag for keeping misc. items in my desk at work. Makes a great place to keep pain killers, a spare razor/toothbrush or anything else I need.",
      "title": "5"
    },
    {
      "id": "20160",
      "abstract": "These laces are a quick and easy way to make any pair of shoes slip ons. My job requires me to take my shoes on and off a lot during the day. Using these laces makes it a lot easier and is a better alternative than trying to slip in and out of shoes with standard laces.",
      "title": "5"
    },
    {
      "id": "20161",
      "abstract": "Purchased this for my son's Halloween costume. The hat fit great and e looked great. One of the best Halloween props I've bought in a while.",
      "title": "4"
    },
    {
      "id": "20162",
      "abstract": "Got 3 of these in various colors for my wife. They look great and are softer than I was expecting.",
      "title": "4"
    },
    {
      "id": "20163",
      "abstract": "I got this for my wife as a joke to try and organize her necklaces that I find all over the house. It turns out she loves it and it looks great! It's much easier to organize her jewelry now and the unit makes it easy to see what she wants to wear. Far better than the wooden jewelry box she had been trying to use. The only complaint I've heard is that the shelf could be a little wider. If you have a lot of chunky jewelry you can only fit 8-10 necklaces across the front.\n\nInstallation note: The top shelf doesn't have any edges. As a result it's important to use a level to make sure the unit is straight when you hang it or things can roll off the top.\n\nOther uses: Aside from jewelry the unit is also useful for holding video game controllers! The side bars can accommodate Wii controllers hung by their wrist straps while the nunchcks can hang in the front. Games and other things can also be stored on the top which can support a decent amount of weight.",
      "title": "5"
    },
    {
      "id": "20164",
      "abstract": "My wife loves this necklace and wears it all the time. The gold/bronze minerals in the turquoise are spectacular and really give the necklace a dimension you don't get with other turquoise.",
      "title": "5"
    },
    {
      "id": "20165",
      "abstract": "Got this for my wife to help organize her earrings. The felt is nice and the holes are easy to fit the earrings into. The rack can easliy stand own but also hangs nicely from my wifes wall mount jewlery hanger.",
      "title": "4"
    },
    {
      "id": "20166",
      "abstract": "Got this tie set for our valentine's day dinner. It looked great, fit well and the packaging didn't leave any creases the way that some do. The handkerchief was creased heavily however and took a dry cleaning run to come out.",
      "title": "4"
    },
    {
      "id": "20167",
      "abstract": "A nice necklace and bracelet set. The color is dark and true to amethyst not the faded versions that you sometimes find. Earrings are easily available but it'd be nice if they were included in the set.",
      "title": "4"
    },
    {
      "id": "20168",
      "abstract": "A great necklace and bracelet set. The color is dark and robust red not the faded versions that you sometimes find. Earrings are easily available but it'd be nice if they were included in the set.",
      "title": "5"
    },
    {
      "id": "20169",
      "abstract": "Overall it's a good looking gown, although the material is a little more 'plastic-y' than other satin items I've seen.\n\nHad some minor issues with the transaction however. Shipping was slow taking 3 days before the item was even in the mail, then receiving the wrong size. It turns out the one they sent fit, so I'll give them the benefit of the doubt, but realistically they made a mistake in the order. Initial emails to attempt a return were speedy but eventually I was told that the size I ordered wasn't actually in stock anyway.",
      "title": "4"
    },
    {
      "id": "20170",
      "abstract": "To my surprise they were a little on the large side and didn't shrink much during washing/drying. Overall they're comfortable and get the job done though.",
      "title": "4"
    },
    {
      "id": "20171",
      "abstract": "Too small and covered in cat hair from a previous owner. Disgusting!",
      "title": "1"
    },
    {
      "id": "20172",
      "abstract": "Overall this is a nice set although the necklace looks a little like costume jewlery. It's also quite stiff with only a few flex points throughout the necklace. The earrings however are fantastic. The only real complaint is the odd clasp which makes the necklace sit a little high. I added an extension in to get it where my wife liked it.\n\nShipping was a little slow with the package coming from China. The items did arrive long before the estimated arrival time but it still took weeks to show up. It also would be nice if the seller sold a matching bracket/hair piece as well.",
      "title": "4"
    },
    {
      "id": "20173",
      "abstract": "This is definitely a situation where you get what you pay for. The actual item is significantly cheaper looking than the photo. The 'rocks' are also made out of plastic and rather dull. I got this for my wife as an accessory for a costume party and it was fine, but it's I doubt it will last too long.",
      "title": "3"
    },
    {
      "id": "20174",
      "abstract": "Fit well and looks alright, although its a little more artificial looking than I was hoping for.",
      "title": "4"
    },
    {
      "id": "20175",
      "abstract": "These shoelaces were low quality. They were wider than most kids laces and difficult to lace into children's shoes. Once laced the clips that are placed on the ends of the laces would regularly pop off.",
      "title": "2"
    },
    {
      "id": "20176",
      "abstract": "These gloves fit me really well although they are a little thinner than I was expecting. It would be nice if they had longer wrists that were able to go under the arm of the costume so my skin isn't showing though. I also find it rather annoying that Rubie decided not to include these with the main costume set and require them as an additional purchase.",
      "title": "3"
    },
    {
      "id": "20177",
      "abstract": "For the price this is a fantastic necklace set! My son got this for my wife on mothers day and we were all VERY impressed! She got TONS of compliments and loved it. She wears it all the time now. Although we ordered the purple, we received the black set but are still VERY happy with them!",
      "title": "5"
    },
    {
      "id": "20178",
      "abstract": "My wife was incredibly happy with this necklace. She got it for a costume party but now wears it all the time. The necklace is much lighter than it looks which is one of the thing my wife loves the most about it.",
      "title": "5"
    },
    {
      "id": "20179",
      "abstract": "This is an incredible robe for kids! It's SUPER soft, even after multiple washes, and the hood was a huge hit! I wish they made these in adult sizes!!",
      "title": "5"
    },
    {
      "id": "20180",
      "abstract": "This is a great costume. It fit well over other clothes and looks great. I was disappointed that the gloves weren't included (see the fine print) but aside from that it looks great!",
      "title": "4"
    },
    {
      "id": "20181",
      "abstract": "The boxers fit as expected. They last well although make sure to use the gentle cycle. 2-3 standard washes will destroy them.",
      "title": "4"
    },
    {
      "id": "20182",
      "abstract": "I use the Smoke version of these glasses which are great for fishing, driving and pretty much anything else you need to do on a sunny day. The frames and lenses are both made of plastic and can come unsnapped occasionally but they are easy enough to put back together. This may seem like a disadvantage to some but for me glasses that float are far better than metal/glass eye wear that would sink if knocked into the water.",
      "title": "4"
    },
    {
      "id": "20183",
      "abstract": "These are great glasses. I've used the plastic versions from this company in the past and these are even better. The only part I don't like is that the ends of the arms touch the glass when folded up and can leave marks behind. I'm constantly having to wipe them off.",
      "title": "4"
    },
    {
      "id": "20184",
      "abstract": "Overall it's a good bike. It's a little trickier to fold than I was expecting but overall it gets the job done and I can fit 2 of them in my trunk. Unfortunately, when it arrived there was significant damage to the front tire (appeared to be a major manufacturing defect), and the tire and tube needed to be replaced before it was usable. Thus far request for a partial refund have gone unanswered.",
      "title": "3"
    },
    {
      "id": "20185",
      "abstract": "Ordered the recreational set. Fun to use outside but the product that arrived was NOT the one in the photo. The set I received does not include a carry bag which makes transporting the set VERY difficult. Eventually I'm sure I'll find something to put them in for storage but people shouldn't be running bait and switch like this.",
      "title": "1"
    },
    {
      "id": "20186",
      "abstract": "The title says it all. Great for making a quick batch of pancakes without making the kitchen look like a tornado went through.",
      "title": "5"
    },
    {
      "id": "20187",
      "abstract": "The title says it all. Great for making a quick batch of pancakes without making the kitchen look like a tornado went through.",
      "title": "5"
    },
    {
      "id": "20188",
      "abstract": "This syrup is delicious and fantastic for making raspberry lime rickeys. My only complaint it that the bottle is really tall and when you attach the pump it comes with it's even taller. It's clearly made to be left on the counter at a coffee shop, etc. and is VERY difficult to get into a cabinet.",
      "title": "4"
    },
    {
      "id": "20189",
      "abstract": "My son loves this stuff and the no-stir variety is much easier to deal with than the standard type that has a tendency to separate.",
      "title": "5"
    },
    {
      "id": "20190",
      "abstract": "Kids liked the movie and the extras are fun to watch although it'd be nice if they were setup as a different video.",
      "title": "4"
    },
    {
      "id": "20191",
      "abstract": "These screen protectors seem to work well. Easy to put on without any bubbles and they do a good job of protecting regular usage from scratching the phone.",
      "title": "4"
    },
    {
      "id": "20192",
      "abstract": "Standard batteries I use for my cars alarm clicker. Overall they work fine although one of the batteries was damaged upon arrival.",
      "title": "4"
    },
    {
      "id": "20193",
      "abstract": "This charger is identical to the one that came in the box with my Illusion phone. The cord is also usable for data transfer. No complaints at all.",
      "title": "5"
    },
    {
      "id": "20194",
      "abstract": "This is a decent cell phone stand, although it could easily be better.\n\nPros:\nEasy to get the phone on and off\nWorks for most phones (see cons for details)\nSolidly built and hard to bend accidentally\n\nCons:\nThe hole in the front that the cord goes through has now slot it the front so plugging the phone in can be a pain\nThe stand is clearly made for older iPhones. Newer phones that use any kind of USB connector will need a 90 degree cord or the phone won't sit on the dock.\nThe dock needs to be a little taller. With any phone bigger than 5 inches it can be easy to tip the phone off backwards. I used some double sided tape to hold the stand in place a little better that helps some.",
      "title": "3"
    },
    {
      "id": "20195",
      "abstract": "This is a FANTASTIC phone! Great performance and with the addition of a 128GB card set to integrated memory on Android Marshmallow I've got a phone that can handle ANYTHING I can throw at it.",
      "title": "5"
    },
    {
      "id": "20196",
      "abstract": "This is a good screen protector for the Moto X Pure. Unfortunatly it was very difficult to put on and picked up a LOT of dust. I much prefer the type of protectors that use a thin layer of spray to ensure no bubbles or dust. This cover is also cut much shorter than the edges of the screen and picks up a LOT of pocket dust. I've been using it for a few months now but I will be replacing it eventually.",
      "title": "3"
    },
    {
      "id": "20197",
      "abstract": "This is a good bump case for the Moto X Pure. It's a little slick and can be slippery (especially when new). This makes it easy to put in your pocket but can be a little tricky when in your hand. If you need something with texture/mat finish look elsewhere.",
      "title": "4"
    },
    {
      "id": "20198",
      "abstract": "This is a good bump case for the Galaxy S7. It was a little tight to get in but worked well overall.",
      "title": "4"
    },
    {
      "id": "20199",
      "abstract": "This is the best car trashcan I've tried to date. Even when full the sandbag in the bottom keeps the box from tipping and dumping trash all over the floor. Being waterproof has also proven to be helpful during long trips. I've been so happy with this unit that I've purchased additional ones for my wife and family's cars.",
      "title": "5"
    },
    {
      "id": "201100",
      "abstract": "These are great gloves for driving and light work. They are a little thin on the top and can leave your hands with a bit of a chill if worn in the cold winter tough. I also would have liked to see the wrist straps come down a little further on my wrist. They feel a little awkward where they are and leave a pretty significant gap between the glove and my jacket when I wear them.",
      "title": "3"
    },
    {
      "id": "201101",
      "abstract": "These are good sheet protectors, but my box arrived bent in half so there was a lot of damage. Luckily I'm not using them for anything critical.",
      "title": "3"
    },
    {
      "id": "201102",
      "abstract": "Great legal pads for general use notes and writing. The pack I ordered came slightly bent because of other things in the package which made it hard to write on them without some kind of backing. A number of the pads also had light or no lines on the last 1/3 of the pages due to a printing error.",
      "title": "4"
    },
    {
      "id": "201103",
      "abstract": "Standard sharpies with a marker end and a pen end. They work well.",
      "title": "5"
    },
    {
      "id": "201104",
      "abstract": "Overall a good lightweight lanyard that's not going to ruin your clothes the way some of the more heavy duty ones do. I ordered black but they're more of a brownish color though. I suspect it's just the plastic coloring though.",
      "title": "4"
    },
    {
      "id": "201105",
      "abstract": "This mouse rug was significantly thinner than the other rugs I've purchased. The mat on top is a thin woven polyester material that's attached to a thin rubber base. It works fine as a mouse pad but it's not the quality I was hoping for given the price. I've already seen the edges beginning to fray and I've only been using it a few weeks.",
      "title": "2"
    },
    {
      "id": "201106",
      "abstract": "Overall this is a nice pot holder for decks, windows and even cubicles. However the description is rather misleading. The 8 inch holder doesn't hold and standard 8 inch pot it IS 8 inches wide at the top. The largest pot I've been able to comfortably fit in the unit is 6.7 inches. Most decorative 7 inch pots don't even fit in. Be aware of this is you're buying this to fit plants you already have potted.\n\nPros:\nSturdy construction\nAdjustable brackets that fit almost anywhere\nWith a quick bending up of the rear brace it can be used in most office cubicles!\n\nCons:\nFits pots smaller that listed in the description.",
      "title": "3"
    },
    {
      "id": "201107",
      "abstract": "This is decent netting for keeping birds off your plants. The holes are a little larger than I would prefer (birds might still be able to pick at fruit close to the edge), and the netting itself is kind of thin. If a bird did fly into it odds are it would get caught so keep an eye out.",
      "title": "3"
    },
    {
      "id": "201108",
      "abstract": "I'm a fan of OXO items and was happy with this watering can. Unfortunately there were a few things that I was surprised about. First the can was quite a bit taller than I was expecting making filing it in a smaller sink (like a bathroom) rather difficult. Second there are 3 screws that hold the handle together but they are oddly placed. There is a large section hear the black grip on the handle that doesn't have a screw and shows a bit of separation. There is no water leaking from it yet but in the future I could definitely see that leaking. Rearranging the screws in the handle could easily fix this. Lastly, the guard at the front of the fill hole isn't quite as tall as it should be and water can splash out when in use, particularly when the can is getting low and requires a high tilt angle. Overall though it's a good watering can.",
      "title": "4"
    },
    {
      "id": "201109",
      "abstract": "I find these spikes to be a far better alternative than liquid fertilizers. Simply add 1-4 spikes (depending on the pot size) and wait to see your plants grow. Although the instructions say to put the spikes in vertically, I've had much better results putting them into the soil horizontally where they can dissolve over more of the root system. I check my spikes every 2-3 months and replace as needed and have had fantastic results.",
      "title": "5"
    },
    {
      "id": "201110",
      "abstract": "I use these hoses in the front and back of my house where I have limited space. The hoses do a great job keeping down the space required for their distance and I highly recommend them. Make sure to bring them in for the winter though. I accidentally left mine out and they both cracked. The spray nozzles that the hoses come with however are horrible. I've ordered 4 of these hoses and 3 of the 4 nozzles were broken spraying water in random directions when the water pressure was turned on. The hose has a standard fitting though so these nozzles can be easily replaced.",
      "title": "4"
    },
    {
      "id": "201111",
      "abstract": "I use these hoses in the front and back of my house where I have limited space. The hoses do a great job keeping down the space required for their distance and I highly recommend them. Make sure to bring them in for the winter though. I accidentally left mine out and they both cracked. The spray nozzles that the hoses come with however are horrible. I've ordered 4 of these hoses and 3 of the 4 nozzles were broken spraying water in random directions when the water pressure was turned on. The hose has a standard fitting though so these nozzles can be easily replaced.",
      "title": "4"
    },
    {
      "id": "201112",
      "abstract": "Overall this cart is very nice. However assembly was a nightmare. The parts for assembly are clearly laid out on a carboard backing so you know what you need for each step. However in 2 steps the supplied nuts/bolts/etc didn't match what was described in the directions. Most importantly the pins that are used to secure the wheels into place are MUCH too long. When they are in place they hit the air spigots on the tires and can damage them. Do yourself a favor and save yourself the aggravation. Go to your local home and garden shop, spend the extra $20 and buy and already assembled cart.",
      "title": "3"
    },
    {
      "id": "201113",
      "abstract": "This is a great hammock for anyone with limited space or who needs to move around a lot (campers, RVers, etc.). The hammock assembles quickly and easily with a series of wingnuts that can easily be tightened by hand and the hammock hooks can be adjusted to whatever tension is the most comfortable. When it's time to go the entire unit fits into a bag that can easily be carried by single person. My only complaints are,\n1) There are metal adapters on the hammock that protect it while it's hooked in place. These adapters are held in place by tension only and have a tendency to fall out. If missing the hooks can seriously damage the hammock loops.\n2) The insides of the metal rods are not treated with the same coating as the outside and have quickly rusted. As a result we have to be careful when we move the unit or we stain everything around us orange from the rust.\n3) This hammock doesn't have the wooden supports most hammocks have and as a result can be thin and fold up on you when you lay in it. Adding a pillow is generally enough to keep this from happening but it would be nice to find a compatible hammock that has these kind of supports in them.",
      "title": "4"
    },
    {
      "id": "201114",
      "abstract": "Great fertilizer for orchids. Gives lots if growth and keeps plants green and healthy looking. I recommend using it at half strength however. At full strength I was getting too much root growth and no flowers for a long time.",
      "title": "4"
    },
    {
      "id": "201115",
      "abstract": "Good fertilizer. Keeps the plants blooming and looking great. I recommend using it less than the instructions however as a few of my smaller plants had some burn out after I started using it. Applying once ever 6-8 weeks seems to be more than enough to keep them happy.",
      "title": "4"
    },
    {
      "id": "201116",
      "abstract": "Good pots for keeping various plants in although they're aren't meant to be decorative. Particularly good for staring small trees, shrubs or vines in. A few of the planters in my bundle were ripped down the side but aside from that my army of trees likes them and will live in them for the winter.",
      "title": "4"
    },
    {
      "id": "201117",
      "abstract": "This is a great replacement for my sump hose that was accidentally cut. It was a little difficult to get into place and attached but once it was fitted it was clear that it wasn't going anywhere.",
      "title": "5"
    },
    {
      "id": "201118",
      "abstract": "This seems like a good fertilizer however the bottle I received was NOT foaming. I received a standard liquid fertilizer. It seems to work fine but be aware in case you specifically need the foaming action.",
      "title": "4"
    },
    {
      "id": "201119",
      "abstract": "I wasn't sure what to expect when I ordered this plant, but when I received the plant I was incredibly impressed. Although less bushy than the plant pictured, the plant I received was in fantastic condition and ready to be immediately transplanted. Assuming it does well once it's planted I will definitely order from them in the future.",
      "title": "5"
    },
    {
      "id": "201120",
      "abstract": "This appears to be a decent plant food. The image showed bottles with foam, but the one I recieved only sprays liquid. That said the plants still seem to like it and are doing well. I'm hoping to see buds soon.",
      "title": "4"
    },
    {
      "id": "201121",
      "abstract": "This is a great fertilizer for succulents. I use it on the plants in my office and they love it.",
      "title": "5"
    },
    {
      "id": "201122",
      "abstract": "Once again Emerald Goddess Gardens produced a fantastic plant. The specimen arrived in excellent condition and after a repotting is doing very well. I can't wait to see it in full bloom!",
      "title": "5"
    },
    {
      "id": "201123",
      "abstract": "Once again the folks at Emerald Goddess Gardens have outdone themselves. The plant arrived in fantastic condition and after a quick transplant into a larger pot is doing very well. I can't wait to see it flower!",
      "title": "5"
    },
    {
      "id": "201124",
      "abstract": "This food makes a mess. Its very light and starts to fall apart as soon as it hits the water. My water was cloudy within a week of using it.",
      "title": "2"
    },
    {
      "id": "201125",
      "abstract": "My water was cloudy within a week of using this food. It falls apart as soon as it hits the water and makes a horrible mess.",
      "title": "2"
    },
    {
      "id": "201126",
      "abstract": "These sink siphon units are nice to have when draining/refilling your aquarium. The vacuum pressure they generate is pretty consistent although they require the use of a lot of tap water so keep that in mind. Although the units function well they aren't particularly durable. I am generally forced to order a new one ever 6-12 months, doing water changes every 2 weeks on my tank. If Python could make these units out of a more durable plastic, or even metal that would be fantastic.",
      "title": "4"
    },
    {
      "id": "201127",
      "abstract": "This is a great adapter for connecting the python to a standard sink during water changes. The units are good quality and last some time before needing replacement. As a secondary advantage this unit will also connect to a standard US hose which we use for everything from plant watering to dog washing when we can't use the outside hoses in the winter.",
      "title": "5"
    },
    {
      "id": "201128",
      "abstract": "Fantastic food! My fish love it and it keeps my water crystal clear. Much better than the Tetra brand foods I used for a bit.",
      "title": "5"
    },
    {
      "id": "201129",
      "abstract": "This food is very soft and starts to fall apart as soon as it hits the water. My water was cloudy within a week if using it.",
      "title": "2"
    },
    {
      "id": "201130",
      "abstract": "These are some of the more high quality blood worms I've come across. My fish love the worms and they don't cloud the water the way other brands can. My only complaint is that the worms can sometimes be 'too dry' and result in a lot of dust that can be a little messy.",
      "title": "4"
    },
    {
      "id": "201131",
      "abstract": "I use these in a food mix I put in my automatic feeder to feed my nocturnal catfish and plecos. They seem to enjoy it and look strong and healthy.",
      "title": "4"
    },
    {
      "id": "201132",
      "abstract": "These tubifex worms have quickly become one of the favorites for my fish. The food comes as pre-pressed cubes which I wasn't expecting but once in the water the fish have no problem picking them apart. It's important to note that the food comes with a descant pack to keep everything dry and it's best to keep that in the can to prevent the cubes from going stale which can happen quickly with summer humidity.",
      "title": "5"
    },
    {
      "id": "201133",
      "abstract": "This is a great breeder for live bearing fish. I've successfully used it to breed guppies, platties and swordtails with great success.\n\nI only have 2 complaints;\n(1) Once the adult fish are in the breeder, uneaten food collects at the bottom and get moldy and is impossible to clean without removing the adult. As a result it's really important to make sure you keep track of how far along your pregnant females are.\n(2) The unit is designed to float in the tank but tends to settle in places with minimal water flow. Clips to secure the unit to the side of the tank would be a nice addition in the future. I've been using some old tank clips and fishing line to keep my breeders in optimal position for best water flow.",
      "title": "4"
    },
    {
      "id": "201134",
      "abstract": "This has quickly become my favorite tubing to use in my tanks. Once submerged it keeps its flexibility much better than many of the clear tubing I've used in the past that can become hard and foggy. The flexibility also allows for tight fits on almost any standard aquarium air pumps and connectors.",
      "title": "5"
    },
    {
      "id": "201135",
      "abstract": "Good tubing for my canister filter. Unfortunately the bundle I got was extremely dusty and clearly had been stored in an odd position and was perma-kinked in a number if places. It took me some time to clean it up and cut out the links before I could use it.",
      "title": "4"
    },
    {
      "id": "201136",
      "abstract": "Great filter pads for the canister system. My package was crushed and the filters had fold marks on them. They worked fine but as a result don't fit into the filter perfectly level.",
      "title": "4"
    },
    {
      "id": "201137",
      "abstract": "Great replacement pads for my Eheim classic filter. Would have like to pay a little less for them though. When they arrived they were VERY dusty and needed to be rinsed a few times before I felt it was safe to put them into the filter.",
      "title": "4"
    },
    {
      "id": "201138",
      "abstract": "I'm using this product along with insecticidal soap and sticky traps to clear out a problem with fungus gnats and aphids I picked up from some new plants. Overall the product seems to do a great job on the gnats but my plant still has a significant number of aphids even after a few weeks of use. Application was trickier than I was expecting as well. The bottle comes with a shaker but unless you're using a massive planter it's really difficult to not make a mess. There is also no way to measure how much material you're adding to the soil as per the instructions. I found that a plastic spoon worked far better for application and mixing with the soil.",
      "title": "4"
    },
    {
      "id": "201139",
      "abstract": "This is great tubing that blends in better than white or blue tubing and is easier to handle and manipulate that the clear version.",
      "title": "5"
    },
    {
      "id": "201140",
      "abstract": "These root tabs work fantastic. I use them in my aquariums and my plants go crazy. The pellets last about 4-6 weeks when pushed under the gravel. If you use a siphoning system be careful not to suck up the pellets when you clean. After about a week the pellet will dissolve under the gravel and can easily be sucked out if one isn't careful.",
      "title": "5"
    },
    {
      "id": "201141",
      "abstract": "I purchased the large version to accommodate some fry in my 75 gallon tank and have been very happy with the unit. Setup was easy and the unit easily fit on the lip of my aquarium which is wider than most (to wide for many HOB filters). Although I thought the unit would be deeper, it does a great job of keeping the water moving through the system which keeps the fish happy and I have had no problems with noise (mentioned in some of the reviews). My only complaint is that although it's easy to put the fish into the box, when using both of the internal dividers (to make 3 compartments), you need a really small net to pull the fish out once they are ready to go back into the tank. I hope that they consider making an extra large version of this at some point, but in the mean time I've already ordered a 2nd unit.",
      "title": "4"
    },
    {
      "id": "201142",
      "abstract": "These have become my favorite airstones. Their large size allows them to sit in at the bottom of the tank and is heavy enough that the air tubing doesn't require suction cups to keep it in place. They also do a great job of giving small, medium and large bubbles to suit your needs depending on the pressure. In one take I have them making really large bubbles while in other tanks I have them setup to make very small bubbles.  They also don't fall apart the way some stones to over time. Overall a very versatile airstone.",
      "title": "5"
    },
    {
      "id": "201143",
      "abstract": "These are great suction cups. Although they are generally used for tank heaters, I've used them for filter tubing and plants as well. They hold up well over time and are easy to clean if needed. Their color also allows them to stay hidden in ways that the white suction cups don't.",
      "title": "5"
    },
    {
      "id": "201144",
      "abstract": "These tweezers are fantastic for maintaining the plants in my deep tanks. The bent end allows easy holding and release of the plants while they are placed into the substrate. These things are huge so keep that in mind before purchasing them for anything smaller than a 30 gallon tank.",
      "title": "5"
    },
    {
      "id": "201145",
      "abstract": "This is a great all around food for livebearer fish (guppies, platties, mollies, etc) of all ages. I supplement this in with my flake food and my fish love this stuff.",
      "title": "5"
    },
    {
      "id": "201146",
      "abstract": "These tablets are a simple way to treat ick. I've used them a number if times (particularly after bringing home new fish) and they always clear the ick without hurting the fish.",
      "title": "5"
    },
    {
      "id": "201147",
      "abstract": "The brief description of this item is very misleading. The seller needs to be MUCH more clear about the size tubing this return can attach to. The unit itself has an ID (inner diameter)of 1/2 inch, and an OD (outer diameter) of 5/8 inch, at the very bottom that gets larger as it tapers up. As a result if you're using standard 1/2 inch ID tubing (as I do in my filter output) it isn't going to fit onto the return since they are both the same size. I'm going to try to find a tubing adapter and some lager tubing to fit at the hardware store, but odds are this is going to get returned.\n\nIt should also be noted that the plastic isn't as heavy duty as I would prefer. I can't use it to test at the moment, but I would guess that the plastic would eventually crack after long use.",
      "title": "1"
    },
    {
      "id": "201148",
      "abstract": "I used this bit for pumpkin carving and it did an incredible job. The bit was easy to control and did a great job of cutting through the material. Although it required an occasional rinse/wipe to get some of the gunk off overall it did a fantastic job and make pumpkin carving incredibly fun this year!",
      "title": "5"
    },
    {
      "id": "201149",
      "abstract": "These are great general work gloves. I use them all over the house, most recently to clear off our deck garden in preparation for winter. They hold up well and keep your hands well protected.",
      "title": "5"
    },
    {
      "id": "201150",
      "abstract": "I got this to add a few additional plugs to one of my kitchen's plugs where we charge most of our devices. I was surprise to find that instead of using both outlets this unit draws power for all 6 plugs from a single wall outlet. Overall it works well but keep that in mind if you plan to use it for anything of heavy use",
      "title": "4"
    },
    {
      "id": "201151",
      "abstract": "Good mask for dust and pollen. Kept my face clear during some renovation and cleaning. Also keeps my wife from sneezing when our lawn gets mowed.",
      "title": "4"
    },
    {
      "id": "201152",
      "abstract": "This is a great set of hangers for pictures of ANY size. At the moment I'm using the largest hanger to hold a rather large planter on the wall and it's doing a fantastic job!",
      "title": "5"
    },
    {
      "id": "201153",
      "abstract": "These are great for adding additional light switches to a room. They're super easy to setup and turn on/off almost flawlessly. The major complaint I have is that although they come in 3 different channels D, E or F, when I ordered 3 sets I received all the same channel. With a rather wide range, as a result I could only use one set in my house before I had to give the others away. Overall a fantastic gadget but one that could really use some specific ordering options or better quality control during order preparation by the seller.",
      "title": "3"
    },
    {
      "id": "201154",
      "abstract": "There are great lights. I use them all over the house and probably have 20 of them in total. They work well and produce a good amount of light. My only complaint is that over time the spring that is required to turn them on/off can wear out leaving them stuck in one position or the other.",
      "title": "4"
    },
    {
      "id": "201155",
      "abstract": "Great mini screwdrivers. I've literally bought dozens of these to give to family and friends and we all LOVE them and use them constantly.",
      "title": "5"
    },
    {
      "id": "201156",
      "abstract": "Great mini screwdrivers. I've literally bought dozens of these to give to family and friends and we all LOVE them and use them constantly.",
      "title": "5"
    },
    {
      "id": "201157",
      "abstract": "This is a fantastic aquarium timer. It's easy to program and can be setup almost any way one would like. It's also nice to see a ground on the electrical connection that isn't always present in other timers.",
      "title": "5"
    },
    {
      "id": "201158",
      "abstract": "These are decent floor registers for central heating/cooling units. They fit into the opening in our condo fine, however when in the open position the 2 large fins stick down an extra 1.5-2 inches. As a result, because of the angle of some of our vent work in some places you cant open the register all the way without bending the fins. If you have shallow vents the way we do it might be worth looking at register that have 3-4 fins that won't stick down so far.",
      "title": "3"
    },
    {
      "id": "201159",
      "abstract": "Got these to replace the ones that came with our portable dishwasher that wore out. They fit well and came with good quality washers.",
      "title": "4"
    },
    {
      "id": "201160",
      "abstract": "These are great cords when you only need a 'little bit more' length in your cords. They're also VERY useful for using every plug in a standard power strip when you have larger plugs.",
      "title": "5"
    },
    {
      "id": "201161",
      "abstract": "These are great slinkys! I got a few for my son to use on the stairs around our house and he loved them. After having purchased some really horrible ones from a few other vendors I was incredibly happy with these. They were just like the ones that I had when I was a kit.",
      "title": "5"
    },
    {
      "id": "201162",
      "abstract": "Got these for my toddler who liked them. I was expecting the pieces to be a little larger but he seemed to like them. The images are fun but I suggest separating the individual puzzles ahead of time since we found that there were a number of pieces that fit together but weren't from the same image which he found frustrating.",
      "title": "4"
    },
    {
      "id": "201163",
      "abstract": "Got these for my toddler who liked them. I was expecting the pieces to be a little larger but he seemed to like them. The images are fun but I suggest separating the individual puzzles ahead of time since we found that there were a number of pieces that fit together but weren't from the same image which he found frustrating.",
      "title": "4"
    },
    {
      "id": "201164",
      "abstract": "My toddler loves Cars and was super excited when he got this. It's big enough that he can play with it and had proven to be more durable than I was expecting.",
      "title": "5"
    },
    {
      "id": "201165",
      "abstract": "I got these for bath time with my kids and they love them. They hold up MUCH better than other similar sponge balls we've used and make a great tub/pool/lake toy!",
      "title": "5"
    },
    {
      "id": "201166",
      "abstract": "Good lego set. The box came damaged but all the parts were present and it was fun to build with my son. Highly recommended for anyone with kids who like the avengers and/or Iron Man!",
      "title": "4"
    },
    {
      "id": "201167",
      "abstract": "I purchased one of these hammocks to get my son's bear collection under control. It did a great job but didn't hold as many animals as I was hoping. Luckily the hammocks aren't terribly expensive so I ordered two additional units to help finish the job. Overall the hammocks to a great job of holding his bear collection.",
      "title": "4"
    },
    {
      "id": "201168",
      "abstract": "These are fantastic extra batteries for my Husban X4. Unlike some of the other batteries I've tried they are the same footprint as the original battery and cause no weight issues during flight. I generally get ~10-15 minutes of flight time per battery, with a recharge time of about 35 minutes. Using a 5 battery charger and a battery pack I can swap these batteries out as needed and fly for almost 2 hours (only limited by the charge of my larger battery pack).",
      "title": "5"
    },
    {
      "id": "201169",
      "abstract": "Fun set of trucks for my toddler who loves this kid of thing. Packaging was a little annoying to get open but aside from that night complaints.",
      "title": "4"
    },
    {
      "id": "201170",
      "abstract": "Awesome lego set for kids. My son was easily able to put this together and enjoyed playing and rebuilding it afterwards. It even came with a few extra parts which was a nice touch.",
      "title": "5"
    },
    {
      "id": "201171",
      "abstract": "Versatile lego set that comes with instructions for multiple creatures and comes with some hard to find parts that can be used to build other thing with. One of my son's favorite sets to build from.",
      "title": "5"
    },
    {
      "id": "201172",
      "abstract": "This is a great charger for my Husban X4 batteries. The unit allows for charging of up to 5 batteries at the same time when connected to a USB port or charger. When out flying I connect this to a mobile battery pack in my bag so I can charge while I'm on the go. I've been very happy with the unit and only hope that in the future the power connection cord could fit in a little better. Mine regularly slips out and I've had to use electrical tape to keep it in place.",
      "title": "4"
    },
    {
      "id": "201173",
      "abstract": "Fantastically fun book! The recipes are interesting, fun and generally easy to make. Great to use with that special someone.",
      "title": "5"
    },
    {
      "id": "201174",
      "abstract": "This is a really funny book that my son loves. Highly recommended.",
      "title": "5"
    }
  ]